PEMEC_straight_hollow_channel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field          | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_1
    {
        type zeroGradient;
    }
    
    inlet_2
    {
        type zeroGradient;
    }

    outlet
    {
        type fixedValue;
        value uniform 0;
    }

    bottom_wall
    {
        type            zeroGradient;
    }

    top_wall
    {
        type            zeroGradient;
    }

    side_walls
    {
        type            zeroGradient;
    }
    
    wall_solid
    {
        type            zeroGradient;
    }
}


